21Apr22/RedditClone/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.user_id = current_user.id

        if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["post_id", 3], ["body", "We're talking about the sports equipment, right?"], ["created_at", "2022-04-26 00:44:24.732893"], ["updated_at", "2022-04-26 00:44:24.732893"]]

    def show
        @comment = Comment.find_by_id(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 ORDER BY "comments"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]