21Apr22/RedditClone/app/controllers/comments_controller.rb

SELECT  comments.*, users.email, posts.title FROM "comments" INNER JOIN "users" ON "users"."id" = "comments"."user_id" INNER JOIN "posts" ON "posts"."id" = "comments"."post_id" WHERE "comments"."id" = $1 ORDER BY "comments"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        # @comment = Comment.find_by_id(params[:id])
        @comment = Comment.where(id: params[:id])
                        .joins(:author)
                        .joins(:post)
                        .select('comments.*, users.email, posts.title')
                        .first