21Apr22/RedditClone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id

        if @post.save
---
INSERT INTO "sub_posts" ("sub_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_id", 2], ["post_id", 3], ["created_at", "2022-04-25 23:41:54.196691"], ["updated_at", "2022-04-25 23:41:54.196691"]]

    def show
        @post = Post.joins(:author)
            .where(id: params[:id])
            .select('posts.*, email')
            .first
        @subs = @post.subs.select(:id, :title)
        @comments = @post.comments.where(parent_comment_id: nil)
---
SELECT  posts.*, email FROM "posts" INNER JOIN "users" ON "users"."id" = "posts"."user_id" WHERE "posts"."id" = $1 ORDER BY "posts"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "subs"."id", "subs"."title" FROM "subs" INNER JOIN "sub_posts" ON "subs"."id" = "sub_posts"."sub_id" WHERE "sub_posts"."post_id" = $1 LIMIT $2  [["post_id", 3], ["LIMIT", 11]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND (parent_comment_id IS NULL) LIMIT $2  [["post_id", 3], ["LIMIT", 11]]

    def update
        @post = Post.find_by_id(params[:id])

        if @post.update(post_params)
            redirect_to post_url(@post)
        else
            flash.now[:errors] = @post.errors.full_messages
            @subs = Sub.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "Even though they are mostly evil, cats are better than both rats and bats. "], ["updated_at", "2022-04-26 00:01:35.964624"], ["id", 3]]
SELECT "subs".* FROM "subs" WHERE 1=0

    def edit
        @post = Post.find_by_id(params[:id])
        @subs = Sub.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subs".* FROM "subs"