21Apr22/RedditClone/app/controllers/subs_controller.rb

    def index
        @subs = Sub.limit(10)
---
SELECT  "subs".* FROM "subs" LIMIT $1  [["LIMIT", 10]]

    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = current_user.id

        if @sub.save
---
INSERT INTO "subs" ("user_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["title", "Cats"], ["description", "Smol Cats. Big Cats. All Cats!"], ["created_at", "2022-04-22 18:32:34.800388"], ["updated_at", "2022-04-22 18:32:34.800388"]]

    def show
        @sub = Sub.joins(:moderator)
                .where(id: params[:id])
                .select('subs.*, email')
                .first
---
SELECT  subs.*, email FROM "subs" INNER JOIN "users" ON "users"."id" = "subs"."user_id" WHERE "subs"."id" = $1 ORDER BY "subs"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @sub ||= Sub.find_by_id(params[:id])

        if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Smol Cats. Big Cats. All the Cats!"], ["updated_at", "2022-04-22 18:36:24.167570"], ["id", 1]]

    def edit
        @sub ||= Sub.find_by_id(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]