23Feb22/routes_practice/app/controllers/users_controller.rb

    def index
        render json: User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)

        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Evil Chris"], ["email", "not.evil.123@evilrecovery.try"], ["created_at", "2022-02-24 01:11:54.388597"], ["updated_at", "2022-02-24 01:11:54.388597"]]

    def show
        user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        user = User.find_by_id(params[:id])

        if !user
            render plain: "User not found.", status: :not_found
        elsif user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Normal Chris"], ["updated_at", "2022-02-24 01:31:35.536830"], ["id", 1]]

    def destroy
        user = User.find_by_id(params[:id])

        if !user
            render plain: "User not found.", status: :not_found
        elsif user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]