28Feb22/routes_practice/app/controllers/artworks_controller.rb

    def index
        if params[:user_id]
            artist = User.find_by_id(params[:user_id])

            if artist
                # TODO: Consolidate into 1 query from User model method
                all_art = []
                all_art += artist.artworks
                all_art += artist.shared_artworks

                render json: all_art
            else
                render plain: 'User not found.', status: :not_found
            end
        else
            render json: Artwork.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"

    def show
        artwork = Artwork.find_by_id(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        artwork = Artwork.find_by_id(params[:id])

       if !artwork
            render plain: 'Artwork not found.', status: :not_found
       elsif artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Untitled-Humble"], ["updated_at", "2022-02-25 01:48:54.831430"], ["id", 7]]

    def destroy
        artwork = Artwork.find_by_id(params[:id])

       if !artwork
            render plain: 'Artwork not found.', status: :not_found
       elsif artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]

    def like
        like = Like.new(user_id: params[:user_id], likeable_id: params[:artwork_id], likeable_type: 'Artwork')

        if like.save
---
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Artwork"], ["likeable_id", 1], ["created_at", "2022-03-01 02:03:28.363708"], ["updated_at", "2022-03-01 02:03:28.363708"], ["user_id", 3]]

    def favorite
        artwork = Artwork.find_by_id(params[:artwork_id])

        if !artwork
            render plain: 'Artwork not found.', status: :not_found
        elsif params[:user_id] != artwork.artist_id.to_s
            render plain: 'Artworks can only be directly favorited by creator.', status: :unprocessable_entity
        else
            artwork.update(favorite: true)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", true], ["updated_at", "2022-03-02 00:29:30.028774"], ["id", 1]]

    def unfavorite
        artwork = Artwork.find_by_id(params[:artwork_id])

        if !artwork
            render plain: 'Artwork not found.', status: :not_found
        elsif params[:user_id] != artwork.artist_id.to_s
            render plain: 'Artworks can only be directly unfavorited by creator.', status: :unprocessable_entity
        else
            artwork.update(favorite: false)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", false], ["updated_at", "2022-03-02 00:30:07.401933"], ["id", 1]]