28Feb22/routes_practice/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"
---
    def index
        if params[:user_id]
            user = User.find_by_id(params[:user_id])

            if !user
                render plain: "User not found.", status: :not_found
            else
                render json: user.comments
            end
        elsif params[:artwork_id]
            artwork = Artwork.find_by_id(params[:artwork_id])

            if !artwork
                render plain: "Artwork not found.", status: :not_found
            else
                render json: artwork.comments
            end
        else
            render json: Comment.all

INSERT INTO "comments" ("artwork_id", "author_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artwork_id", 1], ["author_id", 2], ["body", "\"This doesn't look expensive...\""], ["created_at", "2022-03-01 00:06:54.545097"], ["updated_at", "2022-03-01 00:06:54.545097"]]
---
    def create
        comment = Comment.new(comment_params)

        if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
    def destroy
        comment = Comment.find_by_id(params[:id])

        if !comment
            render plain: "Comment not found.", status: :not_found
        elsif comment.destroy

INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Comment"], ["likeable_id", 1], ["created_at", "2022-03-01 02:02:18.037795"], ["updated_at", "2022-03-01 02:02:18.037795"], ["user_id", 1]]
---
    def like
        like = Like.new(user_id: params[:user_id], likeable_id: params[:comment_id], likeable_type: 'Comment')

        if like.save