28Feb22/routes_practice/app/controllers/likes_controller.rb

    def index
        if params[:user_id]
            user = User.find_by_id(params[:user_id])

            if !user
                render json: 'User not found.', status: :not_found
            else
                # TODO optimize to single query
                likes = user.comment_likes
                likes += user.artwork_likes

                render json: likes
            end
        elsif params[:comment_id]
            comment = Comment.find_by_id(params[:comment_id])

            if !comment
                render json: 'Comment not found.', status: :not_found
            else
                render json: comment.likes
            end
        elsif params[:artwork_id]
            artwork = Artwork.find_by_id(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]