28Feb22/routes_practice/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username iLIKE 'Budoir')
SELECT "users".* FROM "users"
---
    def index
        if params[:query]
            wildcard_term = "%#{params[:query]}%"
            results = User.where('username iLIKE ?', wildcard_term)
            render json: results
        else
            render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        user = User.find_by_id(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Normal Chris"], ["updated_at", "2022-02-24 01:31:35.536830"], ["id", 1]]
---
    def update
        user = User.find_by_id(params[:id])

        if !user
            render plain: "User not found.", status: :not_found
        elsif user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        user = User.find_by_id(params[:id])

        if !user
            render plain: "User not found.", status: :not_found
        elsif user.destroy