21Apr22/RedditClone/app/views/comments/_nested_comments.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."parent_comment_id" = $1  [["parent_comment_id", 2]]
---
<%
child_comments = all_comments.select { |c| c.parent_comment_id == comment.id }