04Mar22/ninetyninecats/app/models/rental_request.rb

    def deny!
        self.update!(status: 'DENIED')
---
UPDATE "rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2022-03-08 00:15:21.016018"], ["id", 9]]

    def overlapping_requests
        rental_cat = Cat.find_by_id(cat_id)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]