04Mar22/ninetyninecats/app/models/rental_request.rb

    def overlapping_requests
        rental_cat = Cat.find_by_id(cat_id)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]