04Mar22/ninetyninecats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "rental_requests".* FROM "rental_requests" WHERE "rental_requests"."cat_id" = $1 ORDER BY "rental_requests"."start_date" ASC  [["cat_id", 2]]
---
    def show
        @cat = Cat.find_by_id(params[:id])
        @rental_requests = @cat.rental_requests.order(:start_date)

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        new_cat = Cat.new(cat_params)

        if new_cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["birth_date", "2020-05-04"], ["updated_at", "2022-03-04 22:12:39.426629"], ["id", 7]]
---
    def update
        @cat = Cat.find_by_id(params[:id])

        if !@cat
            render json: "Cat not found.", status: :not_found
        elsif @cat.update(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @cat = Cat.find_by_id(params[:id])