04Mar22/ninetyninecats/app/controllers/rental_requests_controller.rb

INSERT INTO "rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2022-03-06"], ["end_date", "2022-03-07"], ["created_at", "2022-03-06 19:12:37.514908"], ["updated_at", "2022-03-06 19:12:37.514908"]]
---
    def create
        new_request = RentalRequest.new(rental_request_params)

        if new_request.save