21Apr22/RedditClone/app/views/posts/post.html.erb

SELECT "subs".* FROM "subs" INNER JOIN "sub_posts" ON "subs"."id" = "sub_posts"."sub_id" WHERE "sub_posts"."post_id" = $1  [["post_id", 3]]
---
<ul>
    <% @post.subs.each do |sub| %>