24Feb22/routes_practice/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"
---
    def index
        if params[:user_id]
            artist = User.find_by_id(params[:user_id])

            if artist
                # TODO: Consolidate into 1 query from User model method
                all_art = []
                all_art += artist.artworks
                all_art += artist.shared_artworks

                render json: all_art
            else
                render plain: 'User not found.', status: :not_found
            end
        else
            render json: Artwork.all

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def show
        artwork = Artwork.find_by_id(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Untitled-Humble"], ["updated_at", "2022-02-25 01:48:54.831430"], ["id", 7]]
---
    def update
        artwork = Artwork.find_by_id(params[:id])

       if !artwork
            render plain: 'Artwork not found.', status: :not_found
       elsif artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]
---
    def destroy
        artwork = Artwork.find_by_id(params[:id])

       if !artwork
            render plain: 'Artwork not found.', status: :not_found
       elsif artwork.destroy